src/Documents/УР_ПриказОКадровомИзменении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УР_ПриказОКадровомИзменении</Name>
			<Comment>Приказ о кадровом изменении</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УР_ДанныеПоТрудоустройствуСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УР_ВидыОперацийПриказОКадровомИзменении</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УР_ПриказОКадровомИзменении</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСтарая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/УР_ВидыОперацийПриказОКадровомИзменении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УР_ВидыОперацийПриказОКадровомИзменении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КадровоеПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УР_ПриказОКадровомИзменении/Forms/ФормаДокумента/module.bsl
// Хранит текущую дату документа - для проверки перехода документа в другой период установки номера
Перем мТекущаяДатаДокумента;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПередОткрытием формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда // проверить объект на то, что он еще не внесен в ИБ
		
		// Заполнить реквизиты значениями по умолчанию.
		
		УстановитьНомерДокумента(ЭтотОбъект);

		Автор	= ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента = Дата;
	
	УправлениеВидимостью();
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи формы.
//
Процедура ПослеЗаписи()
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура - обработчик события ПриИзменении поля ввода Дата.
//
Процедура ДатаПриИзменении(Элемент)
	
	ПроверитьНомерДокумента(ЭтотОбъект, мТекущаяДатаДокумента);
	мТекущаяДатаДокумента = Дата; // запомним текущую дату документа для контроля номера документа
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ВидПриказа
//
Процедура ВидПриказаПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Сотрудник
//
Процедура СотрудникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Если ЗначениеЗаполнено(Сотрудник.ГрафикРаботыСотрудника) Тогда
			ГрафикРаботы = Сотрудник.ГрафикРаботыСотрудника;
		КонецЕсли;
		Если ЗначениеЗаполнено(Сотрудник.Подразделение) Тогда
			Подразделение = Сотрудник.Подразделение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Сотрудник.Должность) Тогда
			Должность = Сотрудник.Должность;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Фирма.
//
Процедура ФирмаПриИзменении(Элемент)
	
	УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура управляет видимостью элементов формы
//
Процедура УправлениеВидимостью()

	ЭтоПриемРаРаботу			= ВидПриказа = Перечисления.УР_ВидыОперацийПриказОКадровомИзменении.ПриемНаРаботу;
	ЭтоКадровоеПеремещение		= ВидПриказа = Перечисления.УР_ВидыОперацийПриказОКадровомИзменении.КадровоеПеремещение;
	ЭтоИзменениеУсловийТруда	= ВидПриказа = Перечисления.УР_ВидыОперацийПриказОКадровомИзменении.ИзменениеУсловийТруда;
	ЭтоУвольнение				= ВидПриказа = Перечисления.УР_ВидыОперацийПриказОКадровомИзменении.Увольнение;

	ЭлементыФормы.ДолжностьСтарая.Видимость							= ЭтоКадровоеПеремещение;
	ЭлементыФормы.НадписьДолжностьСтарая.Видимость					= ЭтоКадровоеПеремещение;
	
	ЭлементыФормы.НадписьГрафикРаботы.Видимость						= ЭтоПриемРаРаботу ИЛИ ЭтоКадровоеПеремещение ИЛИ ЭтоИзменениеУсловийТруда;
	ЭлементыФормы.ГрафикРаботы.Видимость							= ЭтоПриемРаРаботу ИЛИ ЭтоКадровоеПеремещение ИЛИ ЭтоИзменениеУсловийТруда;
	
	ЭлементыФормы.НадписьКоличествоСтавок.Видимость					= ЭтоПриемРаРаботу ИЛИ ЭтоКадровоеПеремещение ИЛИ ЭтоИзменениеУсловийТруда;
	ЭлементыФормы.КоличествоСтавок.Видимость						= ЭтоПриемРаРаботу ИЛИ ЭтоКадровоеПеремещение ИЛИ ЭтоИзменениеУсловийТруда;
	
	ЭлементыФормы.НадписьПодразделение.Доступность	= НЕ ЭтоУвольнение;
	ЭлементыФормы.Подразделение.Доступность			= НЕ ЭтоУвольнение;
	
КонецПроцедуры
